[
  {
    "ask":"У кого самый большой хуй?",
    "answer":"Администратор"
  },  
  {
    "ask":"Так в старину называли сторожа городских ворот",
    "answer":"Вратарь"
  },  
  {
    "ask":"Анисовая настойка или ликер",
    "answer":"Абсент"
  },  
  {
    "ask":"Что мексиканцы изготовляли из волокнистой древесины кактусов",
    "answer":"Воротник"
  },  
  {
    "ask":"Изречение, обобщающее различные явления жизни",
    "answer":"Пословица"
  },  
  {
    "ask":"Обязательный элемент женского и парного фигурного катания",
    "answer":"Спираль"
  },  
  {
    "ask":"Первые ружья и пушки Древней Руси",
    "answer":"Пищаль"
  },  
  {
    "ask":"Устаревший мем",
    "answer":"Баян"
  },  
  {
    "ask":"Фамилия известного русского художника 19 века?",
    "answer":"Врубель"
  },  
  {
    "ask":"В Советском Союзе их начали продавать в конце 60-х",
    "answer":"Корейки"
  },  
  {
    "ask":"любимое хобби Ленина В.И.",
    "answer":"шахматы"
  },  
  {
    "ask":"Хлеб из пшеничной муки, обмазанный сметаной и маслом",
    "answer":"Шаньга"
  },  
  {
    "ask":"Какую кличку придумали крестьяне отступающим из России французам? 10 букв",
    "answer":"Шаромыжник"
  },  
  {
    "ask":"В каком чине Надежда Дурова поступила в кавалерийский уланский полк? 7 букв",
    "answer":"Товарищ"
  },  
  {
    "ask":"Через какое место в Таиланде проходит поезд, который называется Меклонг?",
    "answer":"Рынок"
  },  
  {
    "ask":"Что за «устаревший двигатель», по причине которого был отстранен поезд на «Рейнхильских состязаниях»?",
    "answer":"Лошадь"
  },  
  {
    "ask":"Как называется вагон, который придумали для поворотных участков железной дороги?",
    "answer":"Наклоняющийся"
  },  
  {
    "ask":"Для чего используются пассажиры в одном железнодорожном вокзале в Швеции?",
    "answer":"Обогрев"
  },  
  {
    "ask":"Чем были оснащены 2012 году во Франции некоторые железнодорожные вокзалы?",
    "answer":"Фортепиано"
  },  
  {
    "ask":"Какое изобретение принесло известность немецкому барону, которое названо его именем?",
    "answer":"Дрезина"
  },  
  {
    "ask":"На что ориентировались конструкторы при строительстве ж/д в Европе, выбирая расстояние между колесами?",
    "answer":"Колесница"
  },  
  {
    "ask":"Какое ныне существующее слово произошло от греческого «Кирие Элеисон»?",
    "answer":"Куролесить"
  },  
  {
    "ask":"«Фигли-мигли» — слово, обозначающее какие-либо уловки, шутки и что ещё?",
    "answer":"Подмигивание"
  },  
  {
    "ask":"О каком слове идет речь: «в советском лексиконе нельзя давать определение…»?",
    "answer":"Аристократия"
  },  
  {
    "ask":"Какое слово часто использовали столяры?",
    "answer":"Тютелька"
  },  
  {
    "ask":"Они назвали своё движение «Движение за добровольное исчезновение…» чего?",
    "answer":"Воротник"
  },  
  {
    "ask":"Из-за чего на 2 пьесы Екатерины Второй был наложен запрет цензором Гедеоновым?",
    "answer":"Ругательство"
  },  
  {
    "ask":"С чем сравнивал цензуру Салтыков-Щедрин?",
    "answer":"Намордник"
  },  
  {
    "ask":"Китайский император Цинь Ши хуанди боролся с поэзией, историей и…?",
    "answer":"Философия"
  },  
  {
    "ask":"Согласно этому уставу от 1804 года запрещалось писать против бога, власти и…?",
    "answer":"Честь"
  },  
  {
    "ask":"С нарушениями чего нужно было бороться цензорам в Риме?",
    "answer":"Нравственность"
  },  
  {
    "ask":"Самым главным цензором в Советском Союзе, по мнению Войновича, был …?",
    "answer":"Страх"
  },  
  {
    "ask":"Какой вид творчества на Руси был запрещен Патриархом Иоакимом?",
    "answer":"Лубок"
  },  
  {
    "ask":"Какое прозвище старого автомобиля произошло от названия тяжелой закрытой четырехколесной повозки?",
    "answer":"Колымага"
  },  
  {
    "ask":"В Уругвае при дорожно-транспортном происшествии это засчитывается водителю как смягчающее вину обстоятельство. Что именно?",
    "answer":"Опьянение"
  },  
  {
    "ask":" В 1960-х годах в Великобритании компания продавала автомобили не целиком, а в разобранном виде. Что обязательно должно было находиться в этом наборе?",
    "answer":"Инструкция"
  },  
  {
    "ask":"Что должен нести в руке один из трех членов экипажа автомобиля, который шел перед машиной в Англии после закона 1865 года?",
    "answer":"Флаг"
  },  
  {
    "ask":"Что мексиканцы изготовляли из волокнистой древесины кактусов",
    "answer":"Воротник"
  },  
  {
    "ask":"Кто пидор?",
    "answer":"ты"
  }
]