let command = {
	pattern: /^(?:помощь|help)$/i,
	f: (message, bot) => {
		return bot.reply(`Мои команды:

			&#4448; 💼 Работа:
			&#4448; &#4448; 🔨 Устроиться
			&#4448; &#4448; ❌ Уволиться
			&#4448; &#4448; 💰 Вывести

			&#4448; 📊 Бизнес:
			&#4448; &#4448; 💸 Бизнес купить
			&#4448; &#4448; ❌ Бизнес продать

			&#4448; 📒 Игры:
			&#4448; &#4448; 📈 Трейд [вверх/вниз] [ставка]
			&#4448; &#4448; 🦅 Монетка [орёл/решка] [ставка]

			&#4448; 💡 Разное:
			&#4448; &#4448; 💲 Профиль
			&#4448; &#4448; 💰 Банк
			&#4448; &#4448; 🔋 Ферма
			&#4448; &#4448; ☎ Телефон
			&#4448; &#4448; 🚘 Авто
			&#4448; &#4448; &#4448; 🔖 Лицензия
			&#4448; &#4448; 🤝 Передать [сумма] + пересл.сообщение
			&#4448; &#4448; 💎 Бонус
			&#4448; &#4448; 🔝 Топ
			&#4448; &#4448; &#4448; 🔝 Топ баланс
			&#4448; &#4448; &#4448; 🔝 Топ кланы
			&#4448; &#4448; &#4448; 🔝 Топ биткоины
			&#4448; &#4448; 🌍 Биткоин
			&#4448; &#4448; &#4448; 🌍 Биткоин продать
			&#4448; &#4448; &#4448; 🌍 Биткоин купить

			&#4448; 💞 Браки:
			&#4448; &#4448; 💍 Брак [ссылка]
			&#4448; &#4448; 💔 Развод

			&#4448; 🚪 Кланы:
			&#4448; &#4448; 💬 Кинфо
			&#4448; &#4448; 📢 Создать [название] (20000$)
			&#4448; &#4448; 📜 Вступить [название]
			&#4448; &#4448; 📝 Покинуть
			&#4448; &#4448; 📋 Внести [сумма]
			&#4448; &#4448; 💸 Взять [сумма]
			`);
	}
}

module.exports = command;