module.exports = {
	businesses: [[
{name: 'Хлебная лавка', cost: 50000, earn: 200, workers: 1, id: 1, icon: '🥖'},
{name: '5 Хлебных лавок', cost: 350000, earn: 1000, workers: 10, id: 1, icon: '🥖'},
{name: 'Небольшая сеть Хлебных Лавок', cost: 900000, earn: 2625, workers: 30, id: 1, icon: '🥖'},
{name: 'Средняя сеть Хлебных Лавок', cost: 1200000, earn: 3750, workers: 50, id: 1, icon: '🥖'},
{name: 'Лучшая Хлебная Лавка в стране', cost: 4000000, earn: 11000, workers: 200, id: 1, icon: '🥖'}
],
[
{name: 'Маленький ларёк', cost: 100000, earn: 700, workers: 1, id: 2, icon: '🏪'},
{name: 'Средний ларёк', cost: 500000, earn: 3700, workers: 5, id: 2, icon: '🏪'},
{name: 'Средняя сеть ларьков', cost: 950000, earn: 7725, workers: 40, id: 2, icon: '🏪'},
{name: 'Ларьки во всех городах страны', cost: 8000000, earn: 37450, workers: 150, id: 2, icon: '🏪'},
{name: 'Ларьки в каждой стране', cost: 17500000, earn: 79950, workers: 400, id: 2, icon: '🏪'}
],
[
{name: 'Закусочная', cost: 300000, earn: 2700, workers: 3, id: 3, icon: '🍷'},
{name: 'Общепит', cost: 450000, earn: 4350, workers: 7, id: 3, icon: '🍷'},
{name: 'Ресторан', cost: 450000, earn: 7400, workers: 15, id: 3, icon: '🍷'},
{name: 'Небольшая сеть ресторанов', cost: 4000000, earn: 19900, workers: 80, id: 3, icon: '🍷'},
{name: 'Лучшие рестораны в стране', cost: 11000000, earn: 47400, workers: 300, id: 3, icon: '🍷'}
],
[
{name: 'Прилавок', cost: 500000, earn: 4100, workers: 15, id: 4, icon: '🏫'},
{name: 'Магазин', cost: 1250000, earn: 9350, workers: 10, id: 4, icon: '🏫'},
{name: 'Сеть магазинов', cost: 3000000, earn: 23350, workers: 70, id: 4, icon: '🏫'},
{name: 'Сеть супермаркетов', cost: 20000000, earn: 109850, workers: 500, id: 4, icon: '🏫'}
],
[
{name: 'Завод в гараже', cost: 1500000, earn: 8800, workers: 5, id: 5, icon: '🏭'},
{name: 'Средний завод', cost: 3500000, earn: 13800, workers: 20, id: 5, icon: '🏭'},
{name: 'Сеть заводов', cost: 15000000, earn: 60800, workers: 200, id: 5, icon: '🏭'},
{name: 'Главные заводы страны', cost: 50000000, earn: 274800, workers: 1000, id: 5, icon: '🏭'}
],
[
{name: 'Каменная шахта', cost: 25000000, earn: 84700, workers: 50, id: 6, icon: '⛏'},
{name: 'Угольная шахта', cost: 50000000, earn: 117200, workers: 75, id: 6, icon: '⛏'},
{name: 'Золотая шахта', cost: 60000000, earn: 229700, workers: 200, id: 6, icon: '⛏'},
{name: 'Алмазная шахта', cost: 90000000, earn: 432700, workers: 360, id: 6, icon: '⛏'},
{name: 'Крупнейший алмазный карьер', cost: 200000000, earn: 709700, workers: 700, id: 6, icon: '⛏'}
],
[
{name: 'Домашний офис', cost: 80000000, earn: 229625, workers: 10, id: 7, icon: '🏢'},
{name: 'Средний офис',cost: 240000000,earn: 329175,workers: 60,id: 7,icon: '🏢'},
{name: 'Большой офис',cost: 540000000,earn: 614675,workers: 200,id: 7,icon: '🏢'},
{name: 'Офис-небоскрёб',cost: 1000000000,earn: 1227275,workers: 700,id: 7,icon: '🏢'}
],
[
{name: 'Разработчик игр',cost: 150000000,earn: 302000,workers: 5,id: 8,icon: '🕹'},
{name: 'Разработчик игр с приятелем',cost: 200000000,earn: 379500,workers: 10,id: 8,icon: '🕹'},
{name: 'Небольшая компания по созданию игр',cost: 750000000,earn: 1024500,workers: 50,id: 8,icon: '🕹'},
{name: 'Огромная компания По разработке Игр',cost: 5000000000,earn: 6749500,workers: 500,id: 8,icon: '🕹'}
],
[
{name: 'Нефтевышка',cost: 500000000,earn: 707000,workers: 8,id: 9,icon: '🏜'},
{name: 'Нефтеплатформа в море',cost: 750000000,earn: 1019000,workers: 20,id: 9,icon: '🏜'},
{name: 'Нефтеплатформа в океане',cost: 1250000000,earn: 4049000,workers: 50,id: 9,icon: '🏜'},
{name: '5 нефтеплатформ в океане',cost: 5000000000,earn: 15249000,workers: 250,id: 9,icon: '🏜'}
],
[
{name: 'Мини АЭС', cost: 800000000, earn: 1050700, workers: 40, id: 10, icon: '💡'},
{name: 'Средняя АЭС', cost: 1200000000, earn: 1496200, workers: 75, id: 10, icon: '💡'},
{name: 'АЭС с 5 энергоблоками', cost: 4250000000, earn: 3088700, workers: 300, id: 10, icon: '💡'},
{name: 'Крупнейшая АЭС', cost: 10000000000, earn: 34843700, workers: 650, id: 10, icon: '💡'}
],
[
{name: 'Программист', cost: 25000000000, earn: 250000000, workers: 75, id: 11, icon: '🗺'},
{name: 'Начинающий Хакер', cost: 55000000000, earn: 550000000, workers: 150, id: 11, icon: '🗺'},
{name: 'Опытный Хакер', cost: 150000000000, earn: 1500000000, workers: 250, id: 11, icon: '🗺'},
{name: 'Профессиональный Хакер', cost: 550000000000, earn: 5500000000, workers: 500, id: 11, icon: '🗺'},
{name: 'Бог Хакер', cost: 1000000000000, earn: 10000000000, workers: 1000, id: 11, icon: '🗺'},
{name: "HACKER'S COMPANY", cost: 10000000000000, earn: 100000000000, workers: 1500, id: 11, icon: '🗺'}
]]
}