var hp = [
{
	name: "Бинт",
	icon: "👕",
	reg: 10,
	cost: 50,
	id: 0
	},
{
	name: "Лекарства",
	icon: "💊",
	reg: 25,
	cost: 100,
	id: 1
	},
{
	name: "Аптечка",
	icon: "💼",
	reg: 50,
	cost: 150,
	id: 2
	},
{
	name: "Врач на дом",
	icon: "🚑",
	reg: 100,
	cost: 250,
	id: 3
	}
];

var energy = [
{
	name: "Хлеб",
	icon: "🍞",
	reg: 10,
	cost: 50,
	id: 0
	},
{
	name: "Суп",
	icon: "🍜",
	reg: 25,
	cost: 100,
	id: 1
	},
{
	name: "Коффе",
	icon: "☕",
	reg: 50,
	cost: 150,
	id: 2
	},
{
	name: "Энергетик",
	icon: "🍵",
	reg: 100,
	cost: 250,
	id: 3
	}
];

var healt = [
	{
	name: "Голованеболим",
	text: "Таблетки от головной боли",
	icon: "📙",
	cost: 750,
	healt: 1,
	id: 0
	},
	{
	name: "Кашлин",
	text: "Лекарство от кашля",
	icon: "📘",
	cost: 750,
	healt: 2,
	id: 1
	},
	{
	name: "Темпирмин",
	text: "Лекарство от температуры",
	icon: "📗",
	cost: 1000,
	healt: 3,
	id: 2
	},
	{
	name: "Зилановек",
	text: "Лекарство от Рака Мозга...",
	icon: "📚",
	cost: 25000,
	healt: 4,
	id: 3
	}
];

module.exports = {
	hp,
	energy,
	healt
	};